import { Strings } from '../types'

export default {
  welcome_message: 'लीगल गाइड चैटबॉट में आपका स्वागत है!',
  application_short_description: 'यह एक ओपन सोर्स AI संचालित चैटबॉट ऐप है।',
  application_long_description:
    '"लीगल बॉट" एक अभिनव ओपन-सोर्स चैटबॉट है जिसे विशेष रूप से भारत में रहने वाले व्यक्तियों को कानूनी मार्गदर्शन और सहायता प्रदान करने के लिए डिज़ाइन किया गया है। कानूनी विशेषज्ञों और प्रौद्योगिकीविदों की एक टीम द्वारा विकसित, लीगल बॉट का उद्देश्य कानूनी जानकारी और सहायता तक पहुंच को लोकतांत्रिक बनाना है, खासकर उन लोगों के लिए जिनके पास कानूनी संसाधनों या विशेषज्ञता तक आसान पहुंच नहीं है।',
  clear_history: 'इतिहास मिटा दें',
  delete_confirmation: 'क्या आप पूर्णतः आश्वस्त हैं?',
  delete_confirmation_description:
    'यह आपके चैट इतिहास को स्थायी रूप से हटा देगा और आपके डेटा को हमारे सर्वर से हटा देगा।',
  cancel: 'रद्द करना',
  delete: 'मिटाना',
  new_chat: 'नई चैट',
  send_a_message: 'एक संदेश भेजो।',
  delete_chat: 'चैट हटाएँ',
  example_prompt_heading_1: 'क्या है',
  example_prompt_subheading_1:
    'अनुसूचित जाति और अनुसूचित जनजाति अधिनियम, 1989 का प्राथमिक उद्देश्य?',
  example_prompt_heading_2: 'विशिष्ट सुरक्षा क्या करती है',
  example_prompt_subheading_2:
    'अनुसूचित जाति और अनुसूचित जनजाति (अत्याचार निवारण) अधिनियम, 1989 एससी और एसटी व्यक्तियों को ऑफर करता है?',
  example_prompt_heading_3: 'कैसे हैं',
  example_prompt_subheading_3:
    'स्थानीय सरकारी निकायों में अनुसूचित जाति और अनुसूचित जनजाति के लिए सीटें आरक्षित की गईं',
  example_prompt_heading_4: 'क्या है',
  example_prompt_subheading_4:
    'एससी/एसटी अधिनियम के तहत अपने कर्तव्यों की उपेक्षा करने वाले लोक सेवकों के लिए परिणाम क्या होंगे?',
  chat_history: 'बातचीत का इतिहास'
} satisfies Strings
