import { Strings } from '../types'

export default {
  welcome_message: 'ലീഗൽ ഗൈഡ് ചാറ്റ്ബോട്ടിലേക്ക് സ്വാഗതം!',
  application_short_description:
    'ഇതൊരു ഓപ്പൺ സോഴ്സ് AI പവർഡ് ചാറ്റ്ബോട്ട് ആപ്പാണ്.',
  application_long_description:
    '"ലീഗൽ ബോട്ട്" എന്നത് ഇന്ത്യയിൽ താമസിക്കുന്ന വ്യക്തികൾക്ക് നിയമപരമായ മാർഗ്ഗനിർദ്ദേശവും പിന്തുണയും നൽകുന്നതിനായി പ്രത്യേകം രൂപകൽപ്പന ചെയ്ത ഒരു നൂതന ഓപ്പൺ സോഴ്സ് ചാറ്റ്ബോട്ട് ആണ്. നിയമ വിദഗ്ധരുടെയും സാങ്കേതിക വിദഗ്ധരുടെയും ഒരു സംഘം വികസിപ്പിച്ചെടുത്ത, നിയമപരമായ വിവരങ്ങളിലേക്കും സഹായങ്ങളിലേക്കും പ്രവേശനം ജനാധിപത്യവൽക്കരിക്കുക എന്നതാണ് ലീഗൽ ബോട്ട് ലക്ഷ്യമിടുന്നത്, പ്രത്യേകിച്ച് നിയമപരമായ ഉറവിടങ്ങളിലേക്കോ വൈദഗ്ധ്യത്തിലേക്കോ എളുപ്പത്തിൽ പ്രവേശനം ഇല്ലാത്തവർക്ക്.',
  clear_history: 'ചരിത്രം മായ്ക്കുക',
  delete_confirmation: 'നിങ്ങൾക്ക് തീർത്തും ഉറപ്പാണോ?',
  delete_confirmation_description:
    'ഇത് നിങ്ങളുടെ ചാറ്റ് ചരിത്രം ശാശ്വതമായി ഇല്ലാതാക്കുകയും ഞങ്ങളുടെ സെർവറുകളിൽ നിന്ന്\nനിങ്ങളുടെ ഡാറ്റ നീക്കം ചെയ്യുകയും ചെയ്യും.',
  cancel: 'റദ്ദാക്കുക',
  delete: 'ഇല്ലാതാക്കുക',
  new_chat: 'പുതിയ ചാറ്റ്',
  send_a_message: 'ഒരു സന്ദേശം അയയ്ക്കുക.',
  delete_chat: 'ചാറ്റ് ഇല്ലാതാക്കുക',
  example_prompt_heading_1: 'എന്താണ്',
  example_prompt_subheading_1:
    '1989-ലെ പട്ടികജാതി-പട്ടികവർഗ നിയമത്തിൻ്റെ പ്രാഥമിക ലക്ഷ്യം?',
  example_prompt_heading_2: 'What specific protections does',
  example_prompt_subheading_2:
    'പട്ടികജാതി-പട്ടികവർഗ (അതിക്രമങ്ങൾ തടയൽ) നിയമം, 1989 SC, ST വ്യക്തികൾക്ക് വാഗ്ദാനം ചെയ്യുന്നു?',
  example_prompt_heading_3: 'എങ്ങനെയുണ്ട്',
  example_prompt_subheading_3:
    'തദ്ദേശസ്വയംഭരണ സ്ഥാപനങ്ങളിൽ പട്ടികജാതി-പട്ടികവർഗക്കാർക്കായി സംവരണം ചെയ്ത സീറ്റുകൾ',
  example_prompt_heading_4: 'എന്തൊക്കെയാണ്',
  example_prompt_subheading_4:
    'എസ്‌സി/എസ്‌ടി നിയമത്തിന് കീഴിലുള്ള തങ്ങളുടെ ചുമതലകൾ അവഗണിക്കുന്ന പൊതുപ്രവർത്തകരുടെ അനന്തരഫലങ്ങൾ?',
  chat_history: 'ചാറ്റ് ചരിത്രം'
} satisfies Strings
