import { Strings } from '../types'

export default {
  welcome_message: 'சட்ட வழிகாட்டி Chatbotக்கு வரவேற்கிறோம்!',
  application_short_description:
    'இது ஒரு ஓப்பன் சோர்ஸ் AI மூலம் இயங்கும் சாட்போட்',
  application_long_description:
    '"லீகல் பாட்" என்பது இந்தியாவில் வசிக்கும் தனிநபர்களுக்கு சட்ட வழிகாட்டுதல் மற்றும் ஆதரவை வழங்குவதற்காக வடிவமைக்கப்பட்ட ஒரு புதுமையான திறந்த மூல சாட்போட் ஆகும். சட்ட வல்லுநர்கள் மற்றும் தொழில்நுட்ப வல்லுநர்கள் குழுவால் உருவாக்கப்பட்டது, லீகல் பாட், குறிப்பாக சட்ட ஆதாரங்கள் அல்லது நிபுணத்துவத்தை எளிதில் அணுக முடியாதவர்களுக்கு, சட்ட தகவல் மற்றும் உதவிக்கான அணுகலை ஜனநாயகப்படுத்துவதை நோக்கமாகக் கொண்டுள்ளது.',
  clear_history: 'வரலாற்றை அழிக்கவும்',
  delete_confirmation: 'நீங்கள் முற்றிலும் உறுதியாக இருக்கிறீர்களா?',
  delete_confirmation_description:
    'இது உங்கள் அரட்டை வரலாற்றை நிரந்தரமாக நீக்கி, உங்கள் தரவை\nஎங்கள் சேவையகங்களிலிருந்து அகற்றும்.',
  cancel: 'ரத்து செய்',
  delete: 'அழி',
  new_chat: 'புதிய அரட்டை',
  send_a_message: 'செய்தி அனுப்பு.',
  delete_chat: 'அரட்டையை நீக்கு',
  example_prompt_heading_1: 'என்ன',
  example_prompt_subheading_1:
    'பட்டியல் சாதிகள் மற்றும் பழங்குடியினர் சட்டம், 1989 இன் முதன்மை நோக்கம்?',
  example_prompt_heading_2: 'குறிப்பிட்ட பாதுகாப்பு என்ன செய்கிறது',
  example_prompt_subheading_2:
    'பட்டியல் சாதிகள் மற்றும் பழங்குடியினர் (வன்கொடுமைகள் தடுப்பு) சட்டம், 1989 SC மற்றும் ST தனிநபர்களுக்கு வழங்குகிறது?',
  example_prompt_heading_3: 'எப்படி இருக்கின்றன',
  example_prompt_subheading_3:
    'உள்ளாட்சி அமைப்புகளில் பட்டியல் சாதியினர் மற்றும் பழங்குடியினருக்கு ஒதுக்கப்பட்ட இடங்கள்',
  example_prompt_heading_4: 'எவை',
  example_prompt_subheading_4:
    'எஸ்சி/எஸ்டி சட்டத்தின் கீழ் தங்கள் கடமைகளை புறக்கணிக்கும் அரசு ஊழியர்களுக்கு ஏற்படும் விளைவுகள்?',
  chat_history: 'உரையாடல் வரலாறு'
} satisfies Strings
