import { Strings } from '../types'

export default {
  welcome_message: 'లీగల్ గైడ్ చాట్‌బాట్‌కు స్వాగతం!',
  application_short_description: 'ఇది ఓపెన్ సోర్స్ AI పవర్డ్ చాట్‌బాట్ యాప్.',
  application_long_description:
    '"లీగల్ బాట్" అనేది భారతదేశంలో నివసిస్తున్న వ్యక్తులకు చట్టపరమైన మార్గదర్శకత్వం మరియు మద్దతును అందించడానికి ప్రత్యేకంగా రూపొందించబడిన ఒక వినూత్న ఓపెన్ సోర్స్ చాట్‌బాట్. న్యాయ నిపుణులు మరియు సాంకేతిక నిపుణుల బృందంచే అభివృద్ధి చేయబడింది, లీగల్ బాట్ ముఖ్యంగా చట్టపరమైన వనరులు లేదా నైపుణ్యాన్ని సులభంగా యాక్సెస్ చేయలేని వారి కోసం చట్టపరమైన సమాచారం మరియు సహాయానికి ప్రాప్యతను ప్రజాస్వామ్యీకరించడం లక్ష్యంగా పెట్టుకుంది.',
  clear_history: 'చరిత్రను క్లియర్ చేయండి',
  delete_confirmation: 'మీరు ఖచ్చితంగా ఉన్నారా?',
  delete_confirmation_description:
    'ఇది మీ చాట్ చరిత్రను శాశ్వతంగా తొలగిస్తుంది మరియు మా సర్వర్‌ల నుండి\nమీ డేటాను తీసివేస్తుంది.',
  cancel: 'రద్దు చేయండి',
  delete: 'తొలగించు',
  new_chat: 'కొత్త చాట్',
  send_a_message: 'సందేశం పంపండి.',
  delete_chat: 'చాట్‌ని తొలగించండి',
  example_prompt_heading_1: 'ఏమిటి',
  example_prompt_subheading_1:
    'షెడ్యూల్డ్ కులాలు మరియు షెడ్యూల్డ్ తెగల చట్టం, 1989 యొక్క ప్రాథమిక లక్ష్యం?',
  example_prompt_heading_2: 'నిర్దిష్ట రక్షణలు ఏమి చేస్తాయి',
  example_prompt_subheading_2:
    'షెడ్యూల్డ్ కులాలు మరియు షెడ్యూల్డ్ తెగల (అట్రాసిటీల నిరోధక) చట్టం, 1989 SC మరియు ST వ్యక్తులకు ఆఫర్ చేస్తోంది?',
  example_prompt_heading_3: 'ఎలా ఉన్నారు',
  example_prompt_subheading_3:
    'స్థానిక ప్రభుత్వ సంస్థల్లో షెడ్యూల్డ్ కులాలు మరియు షెడ్యూల్డ్ తెగలకు రిజర్వ్ చేయబడిన సీట్లు',
  example_prompt_heading_4: 'ఏవి',
  example_prompt_subheading_4:
    'SC/ST చట్టం ప్రకారం తమ విధులను విస్మరించిన ప్రభుత్వ ఉద్యోగులకు పరిణామాలు?',
  chat_history: 'సంభాషణ చరిత్ర'
} satisfies Strings
